#สร้างโปรแกรมคำนวณอายุของจากปีเกิด (พ.ศ.) ของพนักงานโรงงานแห่งหนึ่ง โดยป้อนชื่อและปีเกิดทางแป้นพิมพ์ ทั้งนี้โปรแกรมจะหยุดทำงานก็ต่อเมมื่อป้อนชื่อพนักงาน เป็น SAU ก็จะหยุดทำงาน

from datetime import datetime

print("---------------------------------------------------")
print("โปรแกรมคำนวณอายุพนักงานโรงงาน")
print("---------------------------------------------------")

while True:
    name = input("ป้อนชื่อพนักงาน: ")
    if name.upper() == "SAU":
        break
    emp_year = int(input("ป้อนปีเกิด (พ.ศ.): "))
    age = (datetime.now().year + 543) - emp_year
    print(f"คุณ {name} เกิดปี {emp_year} อายุ {age} ปี")
    print("---------------------------------------------------")

print("---------------------------------------------------")