# Control Flow แบ่งออกเป็น 2 กลุ่ม /Control Statement แบ่งออกเป็น 2 กลุ่ม
# 1. Selection / Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนการทำงานใดๆ แบ่งเป็น 3 แบบย่อย
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (if)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงไม่ทำ เท็จทำ (if-else)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จทำ   (if-elif-else)

# 2. Loop/Iteration/Repetition ทำซ้ํา คือ ทำงานเดิมๆ ซ้ำๆ แยกเป็น 2 แบบ
# - รู้จำนวนครั้งในการทำซ้ำ
# - ไม่รู้จำนวนครั้งในการทำซ้ำ
# - while, for 
# ***สิ่งที่ต้องระวังในการทำซ้ำคือ ต้องรู้จบ

# ***Statement ที่เกียวกับ Control Flow คือคำสัง  break,continue โดยเฉพาะใน Loop