# โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์
 
# โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่

# 	หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์

# 	หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว

# 	หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช

# 	หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน

# 	หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน

# 	หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม
 
# โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้

#      ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท

#      ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย

#      ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย

#      ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย
 
# โปรแกรมแสดงข้อความต้อนรับนักศึกษา โดยรับชื่อ และชั้นปีทางแป้นพิมพ์แล้วแสดงข้อความต้อนรับ ดังนี้

# 	กรณีป้อนชั้นปี 1 แสดงข้อความ "Welcome Freshman"

# 	กรณีป้อนชั้นปี 2 แสดงข้อความ "Welcome Sophomore"

# 	กรณีป้อนชั้นปี 3 แสดงข้อความ "Welcome Junior"

# 	กรณีป้อนชั้นปี 4 แสดงข้อความ "Welcome Senior"

# 	กรณีป้อน ปีอื่นๆ  แสดงข้อความ "Oh, no ...."
 