print('********************************')
print('********** 6719410040 **********')
print('********************************')
print('1. พื้นที่สี่เหลี่ยม')
print('2. พื้นที่วงกลม')
print('3. ปริมาตรทรงสี่เหลี่ยม')
print('4. ปริมาตรวงกลม')
print('0. ออกจากการทำงาน')
print('********************************')
number = int(input("โปรดเลือกผลคำนวณที่ต้องการ"))
print('********************************')

import math
while number != 0:
    if number == 1:
        width = float(input('ป้อนนความกว้าง:'))
        hight = float(input('ป้อนนความสูง:'))
        area = width * hight
        print(f'พื้นที่สี่เหลี่ยมทั้งหมด: {area:.2f}')
        print('********************************')
    elif number == 2:
        radius = float(input('ป้อนรัศมี : '))
        area = math.pi * radius ** 2
        print(f'พื้นที่วงกลม เท่ากับ : {area:.2f}')
        print('********************************')
    elif number == 3:
        print('คำนวณพื้นที่สามเหลี่ยม')
        base = float(input('ป้อนฐาน : '))
        height = float(input('ป้อนความสูง : '))
        area = 0.5 * base * height
        print(f'พื้นที่สามเหลี่ยม เท่ากับ : {area:.2f}')
        print('********************************')
    elif number == 4:
        print('คำนวณปริมาตรทรงกลม')
        radius = float(input('ป้อนรัศมี : '))
        volume = (4/3) * math.pi * radius ** 3
        print(f'ปริมาตรทรงกลม เท่ากับ : {volume:.2f}') 
        print('********************************')
    else:
        print('เมนูที่เลือกไม่ถูกต้อง')
        print('กรุณาเลือกเมนู 1,2,3,4 หรือ 0 เท่านั้น')
        print('********************************')

    number = int(input('เลือกเมนูที่ต้องการ : '))